Revit 2023 API
RebarFreeFormAccessor.SetLayoutAsMinimumClearSpacing Method
 Sets the Layout Rule property of rebar set to Minimum Clear Spacing.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Since: 2018
Syntax
C#
public void SetLayoutAsMinimumClearSpacing(
	double spacing
)
Visual Basic
Public Sub SetLayoutAsMinimumClearSpacing ( _
	spacing As Double _
)
Visual C++
public:
void SetLayoutAsMinimumClearSpacing(
	double spacing
)
Parameters
spacing
Type: System.Double
 The maximum spacing of bars in set.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.DisabledDisciplineException |  None of the following disciplines is enabled: Structural.
Autodesk.Revit.Exceptions.InvalidOperationException |  This RebarFreeFormAccessor doesn't contain a valid rebar reference. -or- This RebarFreeFormAccessor Rebar doesn't contain a valid server GUID.
See Also
RebarFreeFormAccessor Class
Autodesk.Revit.DB.Structure Namespace